{
    "types": {
        "routine": [
            {
                "id": "19",
                "name": "Full Diet",
                "description": "Diet that does not include any dietary restrictions. It is formerly called as Diet as Tolerated (DAT)."
            },
            {
                "id": "01",
                "name": "Soft Diet",
                "description": "Diet that consists of soft, easily digestible and low residue foods. It is usually prescribed to people with swallowing difficulty and also to those who can’t tolerate normally textured or highly seasoned foods.",
                "subtypes": [
                    {
                        "id": "42",
                        "name": "Soft Cold",
                        "description": "Consists of foods that are soft, well cooked and easy to chew and if necessary chopped, ground or minced"
                    },
                    {
                        "id": "43",
                        "name": "Mechanically Soft",
                        "description": "Consists of soft and bland foods which have been allowed to cool such as plain ice cream, cold milk, iced tea, cold water, chilled soup, etc. This is given in short period of time. "
                    }
                ]
            },
            {
                "id": "46",
                "name": "Therapeutic Diets",
                "description": "a diet adapted or modified to suit specific disease conditions.  It is part of the treatment of a medical condition and are normally prescribed by a physician and planned by a dietitian"
            },
            {
                "id": "18",
                "name": "Clear Liquid",
                "description": "Diet that consists of clear fluid and juices that provide little residue and are easily absorbed. Foods allowed include clear fat-free broth, strained fruit juices, tea, black coffee, salabat, plain gelatin, sugar, hard candies.        "
            },
            {
                "id": "17",
                "name": "General Liquid",
                "description": "Diet that includes fluids and semi-solid foods that are liquid at body temperature. Food allowed include those included in the clear liquid diet plus strained meat and fish, soft cooked egg, vegetable purees and juices, strained lugao and oatmeal, plain ice cream, custard, milk and milk drinks."
            },
            {
                "id": "16",
                "name": "NPO + FTW",
                "description": "To abstain patients from eating or drinking anything, usually before surgery, certain medical tests, or procedures. Food to Watcher is Given to Patients with NPO Diets"
            }
        ],
        "therapeutic": [
            {
                "id": "30",
                "name": "Low Fiber",
                "description": ""
            },
            {
                "id": "05",
                "name": "Low Fat",
                "description": ""
            },
            {
                "id": "40",
                "name": "Low Salt Low Fat",
                "description": "Diet limiting sodium intake to <2,000 mg per day and fats to 10 – 15% of the total calories "
            },
            {
                "id": "06",
                "name": "Low Protein",
                "description": "Diet with protein allowance of 0.5 to 0.7 gram/kilogram/day or 30-40 grams/day"
            },
            {
                "id": "12",
                "name": "High Protein",
                "description": "Diet with protein allowance of 1.5-2.0 grams/kilogram/day or 90-110 grams/day"
            },
            {
                "id": "11",
                "name": "High Fiber",
                "description": "Normal diet with fiber increased to more than 10 grams daily. Diet providing about 20 to 35 grams or more of dietary fiber per day, or approximately 10 to 13 grams fiber/1000 kcal but not less than 20 grams/day"
            },
            {
                "id": "09",
                "name": "DM Diet",
                "description": "Diet aims to control calories, carbohydrates, protein, and fat intake in balanced amounts to meet nutritional needs, control blood sugar levels, and control weight. "
            },
            {
                "id": "25",
                "name": "Vegetarian",
                "description": "Plant-based meals consisting of a variety of whole grains, legumes, nuts, vegetables and fruits"
            }
        ]
    }
}